In [5]:
import pandas as pd
import numpy as np

In [2]:
from sqlalchemy import create_engine

In [3]:
temp_db = create_engine('sqlite:///:memory:')

In [4]:
temp_db

Engine(sqlite:///:memory:)

In [7]:
df = pd.DataFrame(data=np.random.randint(low=0, high=100, size=(4,4)), columns=['a', 'b', 'c','d'])

In [8]:
df

    a   b   c   d
0  71   2  41  30
1  59  49  22  77
2  61   2  36   6
3   2  60  12  50

In [10]:
df.to_sql(name='new_table', con=temp_db)

In [12]:
new_df = pd.read_sql(sql='new_table', con=temp_db)

In [13]:
new_df

   index   a   b   c   d
0      0  71   2  41  30
1      1  59  49  22  77
2      2  61   2  36   6
3      3   2  60  12  50

In [17]:
result = pd.read_sql_query(sql="SELECT a, c FROM new_table", con=temp_db)

In [18]:
result

    a   c
0  71  41
1  59  22
2  61  36
3   2  12